#### 누락 데이터 처리

- 누락 데이터 확인

        Seaborn Library titanic dataset

In [1]:
import seaborn as sns

df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

In [8]:
df.deck.isna().sum()

688

In [10]:
# dropna=False를 사용해야 누락 데이터의 개수를 확인할 수 있다
nan_deck = df.deck.value_counts(dropna=False)
nan_deck

NaN    688
C       59
B       47
D       33
E       32
A       15
F       13
G        4
Name: deck, dtype: int64

- 누락 데이터 제거

In [18]:
df = sns.load_dataset('titanic')

# for문으로 각 열의 NaN 개수 구하기
missing_df = df.isnull()

In [20]:
missing_df.deck.value_counts()

True     688
False    203
Name: deck, dtype: int64

In [13]:
# NaN 값을 500개 이상 가지는 모든 열 삭제
df_thresh = df.dropna(axis=1, thresh=500)
print(df_thresh.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'embark_town', 'alive',
       'alone'],
      dtype='object')

In [14]:
# age 열에 나이 데이터가 없는 모든 행 삭제 - age열(891개 중 177개의 NaN 값)
df_age = df.dropna(subset=['age'], how='any', axis=0)
print(len(df_age))

714

- 누락 데이터 치환

In [17]:
# 평균값으로 치환하기
import seaborn as sns

df = sns.load_dataset('titanic')
print(df.age.head(6),"\n\n")

mean_age = df.age.mean(axis=0)
df.age.fillna(mean_age, inplace=True)

print(df.age.head(6))

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
Name: age, dtype: float64


0    22.000000
1    38.000000
2    26.000000
3    35.000000
4    35.000000
5    29.699118
Name: age, dtype: float64

In [26]:
# 최빈값으로 치환하기
print(df.embark_town[825:830],"\n")

most_ferq = df.embark_town.value_counts(dropna=True).idxmax()
print(most_ferq,"\n")

df.embark_town.fillna(most_ferq, inplace=True)
print(df.embark_town[825:830])

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

Southampton

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829    Southampton
Name: embark_town, dtype: object

In [27]:
# 이웃된 데이터로 치환 (앞->ffill, 뒤->bfill)
import seaborn as sns
df = sns.load_dataset('titanic')

print(df.embark_town[825:830], "\n")

# 829행의 NaN 값을 828행의 값으로 변경하기
df.embark_town.fillna(method='ffill', inplace=True)
print(df.embark_town[825:830])

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829            NaN
Name: embark_town, dtype: object

825     Queenstown
826    Southampton
827      Cherbourg
828     Queenstown
829     Queenstown
Name: embark_town, dtype: object